app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments"."id" = 4)
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("updated_at", "body", "post_id", "created_at") VALUES('2008-11-12 06:02:55', 'This is a comment on the third post', 5, '2008-11-12 06:02:55')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments"
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy