app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2008-11-13 02:02:59', 'First Post', 'So the blog is up and running. I''ll start posting in it tomorrow.', '2008-11-13 02:02:59')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'This is a test entry.
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "comments"
SELECT * FROM "comments" WHERE ("comments".post_id = 3)
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy
    @post.comments.each { |c| c.destroy }